{"status":"ok","totalResults":10,"articles":[{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Rebecca Bellan","title":"Waymo to begin charging for robotaxi rides in San Francisco","description":"Waymo, the self-driving unit of Alphabet, has scored a permit with the California Public Utilities Commission that allows it to charge riders for ride-hailing trips in its autonomous vehicles in San Francisco. A human safety operator must be present, though, …","url":"https://techcrunch.com/2022/02/28/waymo-to-begin-charging-for-robotaxi-rides-in-san-francisco/","urlToImage":"https://techcrunch.com/wp-content/uploads/2020/03/Screen-Shot-2020-03-05-at-3.56.40-PM.jpg?w=720","publishedAt":"2022-03-01T03:18:51Z","content":"Waymo, the self-driving unit of Alphabet, has scored a permit with the California Public Utilities Commission that allows it to charge riders for ride-hailing trips in its autonomous vehicles in San … [+3315 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Stefanie Waldek","title":"NASA extends SpaceX’s Commercial Crew contract by three missions for $900 million","description":"NASA announced today that it has officially awarded SpaceX the Crew-7, Crew-8, and Crew-9 missions to the International Space Station, bringing SpaceX’s total Commercial Crew Transportation Capability (CCtCap) contract to $3.49 billion. The original $2.6 bill…","url":"https://techcrunch.com/2022/02/28/nasa-extends-spacexs-commercial-crew-contract-by-three-missions-for-900-million/","urlToImage":"https://techcrunch.com/wp-content/uploads/2022/02/51635283717_002bc854e4_o.jpg?w=600","publishedAt":"2022-03-01T02:58:26Z","content":"NASA announced today that it has officially awarded SpaceX the Crew-7, Crew-8, and Crew-9 missions to the International Space Station, bringing SpaceXs total Commercial Crew Transportation Capability… [+2418 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Haje Jan Kamps","title":"This imaging sensor sees right through you with terahertz waves","description":"You may not be able to see ’em with your eyes, but in the space between infrared light and microwaves is an invisible stretch of the electromagnetic spectrum where neither electronics nor optical devices can manipulate energy. The cool thing about terahertz w…","url":"https://techcrunch.com/2022/02/28/terahertz-waves/","urlToImage":"https://techcrunch.com/wp-content/uploads/2022/02/MIT_Terahertz-Refractarray-01-PRESS-1.jpg?w=600","publishedAt":"2022-03-01T00:26:31Z","content":"You may not be able to see ’em with your eyes, but in the space between infrared light and microwaves is an invisible stretch of the electromagnetic spectrum where neither electronics nor optical dev… [+3939 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Alex Wilhelm","title":"Daily Crunch: Asian and Hispanic e-grocer Weee! bags $425 million Series E","description":"Hello friends and welcome to Daily Crunch, bringing you the most important startup, tech and venture capital news in a single package.","url":"https://techcrunch.com/2022/02/28/daily-crunch-asian-and-hispanic-e-grocer-weee-bags-425-million-series-e/","urlToImage":"https://techcrunch.com/wp-content/uploads/2022/02/MG_0920.png?w=712","publishedAt":"2022-02-28T23:30:04Z","content":"To get a roundup of TechCrunchs biggest and most important stories delivered to your inbox every day at 3 p.m. PST, subscribe here.\r\nHello and welcome to Daily Crunch for Monday, February 28, 2022. T… [+7273 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Frederic Lardinois","title":"Test automation platform Tricentis acquires Tx3 Services","description":"Test automation platform Tricentis today announced that it has acquired Tx3 Services.","url":"https://techcrunch.com/2022/02/28/test-automation-platform-tricentis-acquires-tx3-services/","urlToImage":"https://techcrunch.com/wp-content/uploads/2022/02/GettyImages-1132173259.jpg?w=600","publishedAt":"2022-02-28T23:24:28Z","content":"Tricentis, a well-funded enterprise-centric test automation platform, is on a bit of an acquisition spree these days. Last year, it acquired performance testing service Neotys. Earlier this month, th… [+1790 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Devin Coldewey","title":"Rocket Lab's Neutron will be built, launched and landed at Wallops Island, Virginia","description":"Rocket Lab has announced the latest expansion of its growing empire of rocket building and launching facilities. While its existing pads in New Zealand and the U.S. will continue to field the company’s smaller Electron rockets, a fresh facility will be built …","url":"https://techcrunch.com/2022/02/28/rocket-labs-neutron-will-be-built-launched-and-landed-at-wallops-island-virginia/","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/12/Neutron-on-the-pad.jpg?w=660","publishedAt":"2022-02-28T23:15:36Z","content":"Rocket Lab has announced the latest expansion of its growing empire of rocket building and launching facilities. While its existing pads in New Zealand and the U.S. will continue to field the company… [+2282 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Natasha Lomas","title":"EU confirms ban on Kremlin-backed media is expected to cover online platforms","description":"The EU’s ban on Kremlin-backed media outlets, Russia Today (RT) and Sputnik (plus any subsidiaries), is expected to cover online platforms and apps as well as traditional broadcast channels, TechCrunch has confirmed. The “unprecedented” sanction was announced…","url":"https://techcrunch.com/2022/02/28/eu-rt-ban-extends-online/","urlToImage":"https://techcrunch.com/wp-content/uploads/2018/05/facebook-kremlin.jpg?w=711","publishedAt":"2022-02-28T23:01:16Z","content":"The EU’s ban on Kremlin-backed media outlets, Russia Today (RT) and Sputnik (plus any subsidiaries), is expected to cover online platforms and apps as well as traditional broadcast channels, TechCrun… [+7447 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Darrell Etherington","title":"Max Q: International space collaboration under threat","description":"This week, the biggest story in the space industry is understandably the biggest story in world events overall: Russia’s invasion of Ukraine. Of course, the most immediate and devastating impact of Russia’s actions are those felt by the people on the ground i…","url":"https://techcrunch.com/2022/02/28/max-q-international-space-collaboration-under-threat/","urlToImage":"https://techcrunch.com/wp-content/uploads/2019/12/tc-space-stars.gif?w=709","publishedAt":"2022-02-28T23:00:41Z","content":"This week, the biggest story in the space industry is understandably the biggest story in world events overall: Russias invasion of Ukraine.\r\nOf course, the most immediate and devastating impact of R… [+2992 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Rebecca Bellan, Alex Wilhelm","title":"Lucid rolls back production goals even as demand for luxury EV rises","description":"The company now expects to build 12,000 to 14,000 cars this year, down from a prior goal of 20,000","url":"https://techcrunch.com/2022/02/28/lucid-rolls-back-production-goals-even-as-demand-for-luxury-ev-rises/","urlToImage":"https://techcrunch.com/wp-content/uploads/2021/01/Screen-Shot-2021-01-31-at-9.03.27-AM.jpg?w=546","publishedAt":"2022-02-28T22:51:33Z","content":"Earnings season rolled along today with notes from Lucid Motors fourth-quarter results. The company, like other electric vehicle (EV) companies, is nascent in revenue terms, albeit further along than… [+5350 chars]"},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Rita Liao","title":"China's social media giants remove 'inappropriate' Ukraine content","description":"China has stuck to its position of refusing to call Russia’s military actions in Ukraine an “invasion” or condemn Moscow, but its people are taking to social media to express their feelings about the war. Over the past few days, Ukraine-related topics have be…","url":"https://techcrunch.com/2022/02/28/chinese-social-media-giants-remove-inappropriate-ukraine-content/","urlToImage":"https://techcrunch.com/wp-content/uploads/2020/09/GettyImages-861781526.jpg?w=600","publishedAt":"2022-02-28T22:12:52Z","content":"China has stuck to its position of refusing to call Russia’s military actions in Ukraine an “invasion” or condemn Moscow, but its people are taking to social media to express their feelings about the… [+1540 chars]"}]}